#include <stdio.h>
  
int main(void)
{
    for(int i=1; i < 100; i++)
    {
        if(i % 2 == 0)
        {
            printf("%d ", i);
        }
    }
    return 0;
}

//Напишите программу, которая с помощью цикла for выводит в одну строку нечетные числа 
