#include <stdio.h>
void hello_world()
{
    printf("agxnyagxnyagxnyagxnyagxny\n");
}
int main(void)
{
    hello_world();
    return 0;
}

// Определите и вызове функцию, которую назовите hello_world и которая будет выводить на консоль строку "Hello World!".
