// Íàïèøèòå ïðîãðàììó îáìåíà çíà÷åíèé äâóõ ïåðåìåííûõ òèïà int. 
// Äëÿ îáìåíà çíà÷åíèÿìè èñïîëüçóéòå 4 ñïîñîáà
// 1) Îáìåí ÷åðåç òðåòüþ ïåðåìåííóþ
// 2) Îáìåí áåç òðåòüåé ïåðåìåííîé
// 3) Îáìåí ÷åðåç îïåðàöèþ XOR
// 4) Îáìåí ñ ïîìîùüþ îäíîãî âûðàæåíèÿ


// 1)
// int a = 1;
// int b = 2;
// int c = a;
// a = b;
// b = c;

// 2)
// int a = 1;
// int b = 2;
// a = a + b;
// b = a - b;
// a = a - b;

// 3)
// int a = 1;
// int b = 2;
// a = a ^ b;
// b = a ^ b;
// a = a ^ b;

// 4)
// int a = 1;
// int b = 2;
// a = a+b-(b=a)
